#!/usr/bin/env mocha -R spec

import {strict as assert} from "assert";
import {Oaza} from "../";

const FILENAME = __filename.split("/").pop() as string;

type Tests = { [code: string]: string };
const tests: Tests = {
    "0600003": "北海道 札幌市中央区北三条西",
    "0300861": "青森県 青森市長島",
    "0200023": "岩手県 盛岡市内丸",
    "9800014": "宮城県 仙台市青葉区本町",
    "0100951": "秋田県 秋田市山王",
    "9900023": "山形県 山形市松波",
    "9608065": "福島県 福島市杉妻町",
    "3100852": "茨城県 水戸市笠原町",
    "3200027": "栃木県 宇都宮市塙田",
    "3710026": "群馬県 前橋市大手町",
    "3300063": "埼玉県 さいたま市浦和区高砂",
    "2600855": "千葉県 千葉市中央区市場町",
    "1600023": "東京都 新宿区西新宿",
    "2310021": "神奈川県 横浜市中区日本大通",
    "9500965": "新潟県 新潟市中央区新光町",
    "9300006": "富山県 富山市新総曲輪",
    "9208203": "石川県 金沢市鞍月",
    "9100005": "福井県 福井市大手",
    "4000031": "山梨県 甲府市丸の内",
    "3800837": "長野県 長野市南長野",
    "5008384": "岐阜県 岐阜市薮田南",
    "4200853": "静岡県 静岡市葵区追手町",
    "4600001": "愛知県 名古屋市中区三の丸",
    "5140006": "三重県 津市広明町",
    "5200044": "滋賀県 大津市京町",
    "6040925": "京都府 京都市中京区上本能寺前町", // 京都市役所
    "5400008": "大阪府 大阪市中央区大手前",
    "6500011": "兵庫県 神戸市中央区下山手通",
    "6308213": "奈良県 奈良市登大路町",
    "6408269": "和歌山県 和歌山市小松原通",
    "6800011": "鳥取県 鳥取市東町",
    "6900887": "島根県 松江市殿町",
    "7000824": "岡山県 岡山市北区内山下",
    "7300011": "広島県 広島市中区基町",
    "7530071": "山口県 山口市滝町",
    "7700941": "徳島県 徳島市万代町",
    "7600017": "香川県 高松市番町",
    "7900001": "愛媛県 松山市一番町",
    "7800850": "高知県 高知市丸ノ内",
    "8120045": "福岡県 福岡市博多区東公園",
    "8400041": "佐賀県 佐賀市城内",
    "8500861": "長崎県 長崎市江戸町",
    "8620950": "熊本県 熊本市中央区水前寺",
    "8700022": "大分県 大分市大手町",
    "8800805": "宮崎県 宮崎市橘通東",
    "8900064": "鹿児島県 鹿児島市鴨池新町",
    "9000021": "沖縄県 那覇市泉崎",
};

describe(FILENAME, () => {
    Object.keys(tests).forEach(code => {
        it(`${code} ${tests[code]}`, () => {
            const oaza = Oaza.byZipcode(code)?.shift();
            const name = `${oaza?.pref?.name} ${oaza?.city?.name}${oaza?.name}`;
            assert.equal(name, tests[code]);
        });
    });
});
